public class Unit2Task6 {
    //Напишите программу вывода всех четных чисел от 2 до 100 включительно

    public static void main(String[] args) {

        int number;

        for (number = 2; number <= 100; number += 2) {
            System.out.println(number);
        }
    }
}
